<?php
$str = <<<START

        <!jjjjjjjj
        ­­Это­HTMLjjjjтаб­ли­ца­с­эле­мен­та­ми­<input>,­по­зво­ляю­щи­ми­вво­дить­дан­ные,­и­с­эле­мен­та­ми­
        ­­<span>,­в­ко­то­рых­ото­бра­жа­ют­ся­ре­зуль­та­ты­вы­чис­ле­ний.­Эти­эле­мен­ты­име­ют­иден­ти­фи­ка­то­ры,
        ­­та­кие­как­"interest"­и­"years".­Дан­ные­иден­ти­фи­ка­то­ры­ис­поль­зу­ют­ся­в­Ja­va­Scriptjjjjко­де,
        ­­ко­то­рый­сле­ду­ет­за­оп­ре­де­ле­ни­ем­таб­ли­цы.­Об­ра­ти­те­вни­ма­ние,­что­для­не­ко­то­рых­эле­мен­тов
        ­­вво­да­оп­ре­де­ле­ны­об­ра­бот­чи­ки­со­бы­тий­"onchange"­и­"onclick".­В­них­за­да­ны­
        ­­стро­ки­Ja­va­Scriptjjjjко­да,­вы­пол­няе­мо­го­при­вво­де­дан­ных­или­щелч­ке­на­кноп­ке.
        jjjjjjjj>
START;

$str =  str_replace("jjjj","",$str);
echo $str;
<body>
<!jjjjjjjj
­­Это­HTMLjjjjтаб­ли­ца­с­эле­мен­та­ми­<input>,­по­зво­ляю­щи­ми­вво­дить­дан­ные,­и­с­эле­мен­та­ми­
­­<span>,­в­ко­то­рых­ото­бра­жа­ют­ся­ре­зуль­та­ты­вы­чис­ле­ний.­Эти­эле­мен­ты­име­ют­иден­ти­фи­ка­то­ры,
­­та­кие­как­"interest"­и­"years".­Дан­ные­иден­ти­фи­ка­то­ры­ис­поль­зу­ют­ся­в­Ja­va­Scriptjjjjко­де,
­­ко­то­рый­сле­ду­ет­за­оп­ре­де­ле­ни­ем­таб­ли­цы.­Об­ра­ти­те­вни­ма­ние,­что­для­не­ко­то­рых­эле­мен­тов
­­вво­да­оп­ре­де­ле­ны­об­ра­бот­чи­ки­со­бы­тий­"onchange"­и­"onclick".­В­них­за­да­ны­
­­стро­ки­Ja­va­Scriptjjjjко­да,­вы­пол­няе­мо­го­при­вво­де­дан­ных­или­щелч­ке­на­кноп­ке.
jjjjjjjj>
<table>
­­<tr><th>Enter­Loan­Data:</th>
­­­­<td></td>
­­­­<th>Loan­Balance,­Cumulative­Equity,­and­Interest­Payments</th></tr>
­­<tr><td>Amount­of­the­loan­($):</td>
­­­­<td><input­id="amount"­onchange="calculate();"></td>
­­­­<td­rowspan=8>
­­­­­­<canvas­id="graph"­width="400"­height="250"></canvas></td></tr>
­­<tr><td>Annual­interest­(%):</td>
­­­­<td><input­id="apr"­onchange="calculate();"></td></tr>
­­<tr><td>Repayment­period­(years):</td>
­­­­<td><input­id="years"­onchange="calculate();"></td>
­­<tr><td>Zipcode­(to­find­lenders):</td